app/controllers/v1/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visit Narnia"], ["done", "f"], ["todo_id", 1], ["created_at", "2018-07-17 12:10:09.794959"], ["updated_at", "2018-07-17 12:10:09.794959"]]
---
  def create
    @todo.items.create!(item_params)

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2018-07-17 12:10:10.168676"], ["id", 1]]
---
  def update
    @item.update(item_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:todo_id])

SELECT  "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo