app/controllers/v1/todos_controller.rb

  def create
    @todo = current_user.todos.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", "2018-07-17 12:10:11.152317"], ["updated_at", "2018-07-17 12:10:11.152317"]]

  def update
    @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Shopping"], ["updated_at", "2018-07-17 12:10:11.608491"], ["id", 1]]