app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", "2018-07-09 21:46:02.599440"], ["updated_at", "2018-07-09 21:46:02.599440"]]
---
  def create
    @todo = current_user.todos.create!(todo_params)

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Shopping"], ["updated_at", "2018-07-09 21:46:02.752118"], ["id", 1]]
---
  def update
    @todo.update(todo_params)